---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeReferenceOptions.Dispose
source: html/dd51c911-7c46-ac8d-e207-04a1d657cc09.htm
---
# Autodesk.Revit.DB.DirectShapeReferenceOptions.Dispose Method

Releases all resources used by the DirectShapeReferenceOptions

## Syntax (C#)
```csharp
public void Dispose()
```